function Cmi=Main_Firgen(Cmi,MLGA,Para,QCwi)
%%%%%%%%%%%%%%%%%%%%注意事项%%%%%%%%%%%%%%%%%%%%
%●染色体采用以“0”相隔的形式，因此需要将染色体解码成每个岸桥的任务才方便进行处理。
%●不同场桥的任务数目可能不同，按照二维数组的特点，任务数目少的岸桥，最后可
%  能好多个0，应该避免好多个0对初始种群生成过程产生影响。
%%%%%%%%%%%%%%%%%%%%程序步骤%%%%%%%%%%%%%%%%%%%%
%1.针对每台岸桥的任务范围，随机生成一个任务安排。
%2.将任务安排进行编码。
%3.将编码后的染色体存入第2行，并将任务安排存入Cmi的第3行。
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
Temp=QCwi;
for i=1:MLGA(1).ChmSum                %每个染色体
    %1.随机生成新的任务安排
    for j=1:Para(1).Sum
        temp=Temp(j,:);
        temp(temp==0)=[];          %将每台岸桥任务里面的0去除。
        result=Fun_Disorder(temp); %打乱任务顺序
        QCwi(j,1:size(result,2))=result;
    end
    %2.染色体编码
    Chrom=MLGA_Encode(QCwi);
    %3.结果存储
    Cmi{1,i}=i;      
    Cmi{2,i}=Chrom;   %存储染色体信息
    Cmi{4,i}=QCwi;   %存储岸桥任务安排信息
end

        