function Chrom=MLGA1_Encode(object)
%%%%%%%%%%%%%%%%%%%%注意事项%%%%%%%%%%%%%%%%%%%%
%●不同场桥的任务数目可能不同，按照二维数组的特点，任务数目少的岸桥，最后可
%  能好多个0，应该避免好多个0对编码过程产生影响。
%%%%%%%%%%%%%%%%%%%%程序步骤%%%%%%%%%%%%%%%%%%%%
%1.先识别要拼接的对象有多少行，也就是有多少台岸桥的任务需要拼接成染色体。
%2.进行拼接。每次拼接后，都会在染色体最后加上“0”，方便间隔不同岸桥任务。
%3.将染色体最后的“0”删除，防止产生干扰。
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%1.读取设备数目和最大任务数目+1（最后是个0）
[rowsum,linesum]=size(object); 
%2.各岸桥任务拼接
Chrom=[];
val=1;
row=1;
for i=1:rowsum
    for j=1:linesum
        if object(i,j)==0    %如果是0，就切换到下一行读取
           Chrom(1,val)=0;
           val=val+1;
           row=row+1;
           break
        else
           Chrom(1,val)=object(i,j);
           val=val+1;
        end
    end
end
%3.将染色体最后的0删除
Chrom(:,end)=[];